KripKrop72724/auto_attn/firmware/zone_lite/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_OFFSET=0x10000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# The deployed boards use octal PSRAM; large user and attendance snapshots
# allocate there while socket/control state remains in internal RAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Prefer PSRAM for application buffers above 4 KiB and preserve internal RAM
# for the capture, ADD, and direct-ORDS task stacks on OTA first boot.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The 16 KiB TLS receive buffer cannot fit the fragmented internal heap once
# both ZKT delivery stacks are running after an OTA boot. Prefer internal RAM
# for small mbedTLS allocations; let large buffers use the existing PSRAM malloc
# policy, as the Hikvision family already does on this hardware.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y

# Device credentials and site configuration are encrypted with XTS keys
# derived from a per-device HMAC key in read/write-protected eFuse block 0.
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=0

# A/B application OTA with first-boot confirmation. Release binaries are
# remotely signed with the protected RSA-3072 fleet key. Anti-rollback remains
# disabled so the last known-good signed application is a recovery target.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_SECURE_BOOT=y
CONFIG_SECURE_BOOT_V2_ENABLED=y
CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=n
CONFIG_SECURE_BOOT_ENABLE_AGGRESSIVE_KEY_REVOKE=n
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n

CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# ESP-IDF's HTTP server listens dual-stack when IPv6 is enabled. The captive
# portal request guard therefore handles both native IPv4 and IPv4-mapped IPv6
# socket addresses explicitly.
CONFIG_LWIP_IPV6=y

# The setup AP is an isolated configuration surface, never a router/NAT path.
# Normal operation remains station-only and does not run DNS or HTTP services.
CONFIG_LWIP_IP_FORWARD=n
